package telegram;

public class Messages {

    public final String GREETENG_MESSAGE= " \nПривет! Я Telegram бот, и я помогу составить вам ваше колесо жизненного баланса. Нажмите на кнопку \"Составить колесо\"";

    public final String HELP = "Распишите свои цели по 8-ми сферам жизни, реализовав которые вы будете себя чувствовать на 10 баллов из 10 в этой сфере (полностью удовлетворены результатом в этой сфере и счастливы). Сделайте это максимально конкретно по SMART (укажите дедлайн цели, четкую характеристику достижения в цифрах (3000$, 20 км бега, 40 книг в год, 10 новых стран, 3 отдыха в год и т.д.)).\n" + " \n" +
                               "Примеры правильных целей из разных сфер: \"хочу читать 52 книги в год\"(развитие), \"хочу получать 3000$ через 3 года\" (финансы), \"хочу побывать в 7 странах за год\"(отдых, путешествия), \"хочу пробежать полумарафон\" (здоровье).";

    public final String BUTTON_1_CREATE_WHEEL = "Составить колесо";
    public final String BUTTON_2_HELP = "Помощь";

    public final String SMILE = "❤";
    public final String THANK_YOU = "Спасибо, что подключились к нам !  \uD83D\uDE04 ";
    public final String START = "Отлично, начинаем! Я буду показывать вам сферы вашей жизни. Оценивайте их по десятибальной шкале, где 1 - это все плохо, 10 - это очень хорошо, лучше тебе и не нужно в этой сфере. Начинаем!\n";
    public final String TEST_COMPLETE = "Спасибо вам, что прошли наш тест и составили Колесо жизненного баланса!  Сайчас будут ваши результаты.";
    public final String RESULT = "Ваша удовлетворенность жизнью на данный момент - ";
    public final String REPEAT = "Если хотите, можете составить Колесо жизненного баланса еще раз! Может быть, вы что-то хотите изменить в своих ответах.";

    public final String BUTTON_1 = "1";
    public final String BUTTON_2 = "2";
    public final String BUTTON_3 = "3";
    public final String BUTTON_4 = "4";
    public final String BUTTON_5 = "5";
    public final String BUTTON_6 = "6";
    public final String BUTTON_7 = "7";
    public final String BUTTON_8 = "8";
    public final String BUTTON_9 = "9";
    public final String BUTTON_10 = "10";

    public final String SPHERE_1_CAREER = "Сфера 1  Карьера.   Насколько вы довольны своей работой, выполняете ли вы свою жизненную миссию, как вы оцениваете свой вклад и успехи, каковы ваши перспективы в карьере/бизнесе, продолжаете ли вы расти и развиваться в своей карьере/бизнесе.";
    public final String SPHERE_2_FAMILY = "Сфера 2  Семья.   Какие у Вас взаимоотношения с родителями и другими ближайшими родственниками. Как вы оцениваете свои отношения с ними, духовную и эмоциональную связь, взаимопонимание, как вы проводите с ними время.";
    public final String SPHERE_3_WEALTH = "Сфера 3  Финансовое благополучие.   Насколько Вы удовлетворены своими доходами и умеете правильно обращаться с ними. Какие у Вас дополнительные источники дохода. На каком уровне финансов Вы находитесь – безопасность/независимость/свобода.";
    public final String SPHERE_4_ENVIROMENT = "Сфера 4   Окружение.   Как вы оцениваете качество вашего окружения, ваш дом и атмосферу в доме, ваш офис, довольны ли вы своим имуществом, чего вам не хватает для комфорта и счастья.";
    public final String SPHERE_5_DEVELOPMENT = "Сфера 5   Развитие.   Как вы оцениваете собственное развитие, чувствуете ли вы что растете в личностном отношении, или считаете что есть куда стремиться.";
    public final String SPHERE_6_RECREATION = "Сфера 6   Отдых.   Как вы проводите своё свободное время, как вы сами оцениваете свой отдых и его качество. Хотите ли вы что-то улучшить, или считаете что близки к идеалу.";
    public final String SPHERE_7_TRAVELS = "Сфера 7   Путешествия.   Путешествуете ли вы, пробуете ли что-то новое. Как вы оцениваете ваши путешествия, нравятся ли они вам, или может хотите что-то изменить.";
    public final String SPHERE_8_HEALTH = "Сфера 8   Здоровье.   Как хорошо вы заботитесь о своем здоровье, ваше питание, физические нагрузки, насколько вы довольны своим физическим состоянием и здоровьем.";

    public final String POINTS_1 = "1 - хуже некуда \n";
    public final String POINTS_2 = "2 - очень плохо \n";
    public final String POINTS_3 = "3 - плохо \n";
    public final String POINTS_4 = "4 - так себе \n";
    public final String POINTS_5 = "5 - хорошо \n";
    public final String POINTS_6 = "6 - очень хорошо \n";
    public final String POINTS_7 = "7 - замечательно \n";
    public final String POINTS_8 = "8 - отлично \n";
    public final String POINTS_9 = "9 - прекрасно \n";
    public final String POINTS_10 = "10 - супер! \n";

}
