package telegram;

public class Messages {

    public final String GREETENG_MESSAGE= " \nПривет! Я Telegram бот, и я помогу составить вам ваше колесо жизненного баланса. Нажмите на кнопку \"Составить колесо\"";

    public final String HELP = "Распишите свои цели по 8-ми сферам жизни, реализовав которые вы будете себя чувствовать на 10 баллов из 10 в этой сфере (полностью удовлетворены результатом в этой сфере и счастливы). Сделайте это максимально конкретно по SMART (укажите дедлайн цели, четкую характеристику достижения в цифрах (3000$, 20 км бега, 40 книг в год, 10 новых стран, 3 отдыха в год и т.д.)).\n" + " \n" +
                               "Примеры правильных целей из разных сфер: \"хочу читать 52 книги в год\"(развитие), \"хочу получать 3000$ через 3 года\" (финансы), \"хочу побывать в 7 странах за год\"(отдых, путешествия), \"хочу пробежать полумарафон\" (здоровье).";

    public final String BUTTON_1_CREATE_WHEEL = "Составить колесо";
    public final String BUTTON_2_HELP = "Помощь";

    public final String SMILE = "❤";
    public final String THANK_YOU = "Спасибо, что подключились к нам !  \uD83D\uDE04 ";
    public final String START = "\"Отлично, начинаем! Я буду показывать вам сферы вашей жизни. Оценивайте их по десятибальной шкале, где 1 - это все плохо, 10 - это очень хорошо, лучше тебе и не нужно в этой сфере. Начинаем!\n";

    public final String BUTTON_1 = "1";
    public final String BUTTON_2 = "2";
    public final String BUTTON_3 = "3";
    public final String BUTTON_4 = "4";
    public final String BUTTON_5 = "5";
    public final String BUTTON_6 = "6";
    public final String BUTTON_7 = "7";
    public final String BUTTON_8 = "8";
    public final String BUTTON_9 = "9";
    public final String BUTTON_10 = "10";

    public final String SPHERE_1_CAREER = "Насколько вы довольны своей работой, выполняете ли вы свою жизненную миссию, как вы оцениваете свой вклад и успехи, каковы ваши перспективы в карьере/бизнесе, продолжаете ли вы расти и развиваться в своей карьере/бизнесе.";
    public final String SPHERE_2_FAMILY = "Какие у Вас взаимоотношения с родителями и другими ближайшими родственниками. Как вы оцениваете свои отношения с ними, духовную и эмоциональную связь, взаимопонимание, как вы проводите с ними время.";
    public final String SPHERE_3_WEALTH = "Насколько Вы удовлетворены своими доходами и умеете правильно обращаться с ними. Какие у Вас дополнительные источники дохода. На каком уровне финансов Вы находитесь – безопасность/независимость/свобода.";
    public final String SPHERE_4_ENVIROMENT = "Как вы оцениваете качество вашего окружения, ваш дом и атмосферу в доме, ваш офис, довольны ли вы своим имуществом, чего вам не хватает для комфорта и счастья.";
    public final String SPHERE_5_DEVELOPMENT = "Как вы оцениваете собственное развитие, чувствуете ли вы что растете в личностном отношении, или считаете что есть куда стремиться.";
    public final String SPHERE_6_RECREATION = "Как вы проводите своё свободное время, как вы сами оцениваете свой отдых и его качество. Хотите ли вы что-то улучшить, или считаете что близки к идеалу.";
    public final String SPHERE_7_TRAVELS = "Путешествуете ли вы, пробуете ли что-то новое. Как вы оцениваете ваши путешествия, нравятся ли они вам, или может хотите что-то изменить.";
    public final String SPHERE_8_HEALTH = "Как хорошо вы заботитесь о своем здоровье, ваше питание, физические нагрузки, насколько вы довольны своим физическим состоянием и здоровьем.";

}
